
# coding: utf-8

import pandas as pd
from scipy import stats
import numpy as np


#读取文件
df = pd.read_csv("/home/zhangzhiliang/Documents/DATA/project/guojibunansudan/nansudan-1208-ML.csv")

#分组依据,参看有哪些属性
df.columns.values

#分组,手动录入
group = [ '']
group_1 = ['']


# In[12]:


#统计量,手动录入
statistics = ['GHQ总分', '自我肯定', '抑郁', '焦虑', '职场表现总分', '工作投入', '团队促进', '成就感', '工作胜任',
       '工作情绪', '组织认同', '离职倾向', '尽责性', '开放性', '神经质', '外倾-内倾', '宜人性',
       '追求成就-尽责性', '谨慎-尽责性', '自律-尽责性', '自我效能-尽责性', '整洁-尽责性', '忠于职守-尽责性',
       '冒险-开放性', '艺术兴趣-开放性', '情绪化-开放性', '想象力-开放性', '思考-开放性', '自由主义-开放性',
       '放纵-神经质', '自我意识-神经质', '脆弱-神经质', '愤怒-神经质', '焦虑 -神经质', '抑郁-神经质',
       '活动水平-内外倾', '坚持-内外倾', '开心-内外倾', '追求兴奋-内外倾', '合群-内外倾', '友善-内外倾',
       '合作-宜人性', '道德感-宜人性', '利他-宜人性', '谦虚-宜人性', '同情心-宜人性', '信任-宜人性',
       '消极（未反向）', '积极', '偏见得分（已反向）', '歧视得分（已反向）', '外派安全感受', '社会安全', '健康安全',
       '工作场所安全',]


# In[20]:


#分组统计,如何进行自动化的分组统计
group_st = []
n = 1
for i in group_1:
    group_st[n].append[df.groupby(i)]
    n = n + 1

